# Винни-Пух попросил Вас посмотреть, есть ли в его стихах ритм. Поскольку разобраться в его кричалках не настолько просто, насколько легко он их придумывает, Вам стоит написать программу. Винни-Пух считает, что ритм есть, если число слогов (т.е. число гласных букв) в каждой фразе стихотворения одинаковое. Фраза может состоять из одного слова, если во фразе несколько слов, то они разделяются дефисами. Фразы отделяются друг от друга пробелами. Стихотворение  Винни-Пух вбивает в программу с клавиатуры. В ответе напишите “Парам пам-пам”, если с ритмом все в порядке и “Пам парам”, если с ритмом все не в порядке

def checkThePhrase(phrase):
    count = 0
    for letter in phrase:
        if letter in ["а", "у", "и", "ы", "о", "э", "ю", "я", "е", "ё"]:
            count += 1
    return count


def checkTheSong(func, song):
    return len(set(map(func, song.split())))


song = "пара-ру-рам рым-пам-папам па-ра-па-да "
if checkTheSong(checkThePhrase, song) == 1:
    print("Парам пам-пам")
else:
    print("Пам парам")
